{
  "otherProjects": [
    {
      "name": "Harmony",
      "description": "A text chat app where users can communicate with each other in real time. Inspired by Discord, it allows users to create online communities and chatrooms easily and invite others. Users can send messages in channels, or to other users via direct messages.",
      "link": "https://github.com/VoChrisK/Harmony",
      "technologies": [
          "React",
          "Ruby on Rails",
          "PSQL"
      ],
      "delay": "0"
    },
    {
      "name": "SWEETT",
      "description": "A single page web app where software engineering job seekers can simultaneously keep track of their time and goals. Users can record their time for various tasks and create their own goals and categories to suit their needs. This was built in a team of four.",
      "link": "https://github.com/VoChrisK/sweett",
      "technologies": [
          "React",
          "Express",
          "MongoDB"
      ],
      "delay": "200"
    },
    {
      "name": "Twelvefold Way App",
      "description": "A web tool for practicing the Twelvefold Way, a systematic classification of twelve formulas relating to two finite sets in Combinatorics. It uses the balls-and-bins and stars-and-bars models to help guide on how each formula works.",
      "link": "https://github.com/VoChrisK/interactive-twelvefold-way",
      "technologies": [
          "JavaScript",
          "Canvas",
          "HTML"
      ],
      "delay": "400"
    },
    {
      "name": "3-D Space Lander",
      "description": "A 3-D game where you control a space lander in a moon-like environment. This game supports collision detection, physics and particle simulations, and camera functionalities. This game was my final project for my Computer Game Design class.",
      "link": "https://github.com/VoChrisK/3D-Space-Lander",
      "technologies": [
          "C++",
          "openFrameworks"
      ],
      "delay": "600"
    },
    {
      "name": "SCKFlight",
      "description": "A Window-based, GUI app that allows users to create and manage airlines reservations. Me and my team used MySQL to define the database and JDBC to connect it to the Java app. This app was my team project for my Database Management Systems class.",
      "link": "https://github.com/khoavo09/SCKFlight",
      "technologies": [
          "Java",
          "MySQL",
          "JDBC"
      ],
      "delay": "800"
    },
    {
      "name": "Mancala Game",
      "description": "A Window-based, GUI app replicating the traditional Mancala game. This app follows the Object-oriented principles and two design patterns: MVC and Decorator pattern. This app was my team project for my Object Oriented Design class.",
      "link": "https://github.com/VoChrisK/Mancala-Game",
      "technologies": [
          "Java",
          "Swing",
          "AWT"
      ],
      "delay": "1000"
    }
  ]
}